In [1]:
# Add Matplotlib inline command
%matplotlib inline

#Dependencies and Setup 
import matplotlib.pyplot as plt
import pandas as pd

In [2]:
#Define files to load

city_data_to_load = 'Resources/city_data.csv'
ride_data_to_load = 'Resources/ride_data.csv'

#Reading in the data and store in a pandas dataframe

city_df = pd.read_csv(city_data_to_load)
ride_df = pd.read_csv(ride_data_to_load)

city_df.head(10)

            city  driver_count   type
0    Richardfort            38  Urban
1   Williamsstad            59  Urban
2    Port Angela            67  Urban
3     Rodneyfort            34  Urban
4    West Robert            39  Urban
5   West Anthony            70  Urban
6    West Angela            48  Urban
7  Martinezhaven            25  Urban
8      Karenberg            22  Urban
9    Barajasview            26  Urban

In [3]:
ride_df.head(10)

                 city                 date   fare        ride_id
0  Lake Jonathanshire  2019-01-14 10:14:22  13.83  5739410935873
1  South Michelleport  2019-03-04 18:24:09  30.24  2343912425577
2  Port Samanthamouth  2019-02-24 04:29:00  33.44  2005065760003
3          Rodneyfort  2019-02-10 23:22:03  23.44  5149245426178
4          South Jack  2019-03-06 04:28:35  34.58  3908451377344
5        South Latoya  2019-03-11 12:26:48   9.52  1994999424437
6       New Paulville  2019-02-27 11:17:56  43.25   793208410091
7        Simpsonburgh  2019-04-26 00:43:24  35.98   111953927754
8     South Karenland  2019-01-08 03:28:48  35.09  7995623208694
9       North Jasmine  2019-03-09 06:26:29  42.81  5327642267789

# Checking the city data.

1. Take a quick look at the overall stats
2. Looking for null values
3. verify data types
4. Find out destinct City names and counts

In [4]:
city_df.describe()

       driver_count
count    120.000000
mean      24.775000
std       20.277678
min        1.000000
25%        7.000000
50%       20.500000
75%       38.250000
max       73.000000

In [5]:
city_df.count()

city            120
driver_count    120
type            120
dtype: int64

In [6]:
city_df.isnull().sum()

city            0
driver_count    0
type            0
dtype: int64

In [7]:
city_df.dtypes

city            object
driver_count     int64
type            object
dtype: object

In [8]:
city_df["type"].unique()

array(['Urban', 'Suburban', 'Rural'], dtype=object)

In [9]:
city_df["city"].unique()

array(['Richardfort', 'Williamsstad', 'Port Angela', 'Rodneyfort',
       'West Robert', 'West Anthony', 'West Angela', 'Martinezhaven',
       'Karenberg', 'Barajasview', 'Robertport', 'Joneschester',
       'Leahton', 'West Christopherberg', 'Johnton', 'Reynoldsfurt',
       'Port David', 'New Kimberlyborough', 'Carriemouth', 'Rogerston',
       'Jerryton', 'Loganberg', 'Simpsonburgh', 'Port Frank',
       'South Latoya', 'West Samuelburgh', 'Grahamburgh',
       'West Patrickchester', 'North Madeline', 'South Jack', 'Liumouth',
       'West Ericstad', 'Royland', 'Erikaland', 'Huntermouth',
       'Justinberg', 'South Evanton', 'Lake Danielberg',
       'East Kaylahaven', 'West Heidi', 'Karenside', 'South Karenland',
       'West Gabriel', 'North Markport', 'Raymondhaven', 'North Barbara',
       'Lake Scottton', 'West Josephberg', 'Pattyland',
       'South Michelleport', 'Christopherfurt', 'Valentineton',
       'South Phillip', 'North Jason', 'Deanville', 'Lake Jonathanshire',
       'New Paulton', 'Hurleymouth', 'Port Johnbury', 'North Jasmine',
       'New Paulville', 'Amandaburgh', 'Williamsview', 'New Jacobville',
       'Port Samanthamouth', 'Roberthaven', 'Port Shane', 'Lake Ann',
       'Lake Scott', 'Colemanland', 'New Raymond', 'South Teresa',
       'Myersshire', 'Grayville', 'Lake Robertside', 'Lewishaven',
       'Rodriguezview', 'Victoriaport', 'Williamsonville', 'West Hannah',
       'West Kimmouth', 'New Shannonberg', 'North Timothy', 'New Olivia',
       'Lake Omar', 'Sotoville', 'Veronicaberg', 'East Kentstad',
       'Bethanyland', 'South Brenda', 'Barronchester', 'Brandonfort',
       'East Danielview', 'East Marymouth', 'Mezachester', 'Lewisland',
       'Josephside', 'Davidfurt', 'Nicolechester', 'East Aaronbury',
       'North Richardhaven', 'North Jeffrey', 'South Jennifer',
       'West Heather', 'Newtonview', 'North Holly', 'Michaelberg',
       'Taylorhaven', 'Penaborough', 'Harringtonfort', 'Lake Jamie',
       'Lake Latoyabury', 'North Jaime', 'South Marychester', 'Garzaport',
       'Bradshawfurt', 'New Ryantown', 'Randallchester', 'Jessicaport',
       'South Saramouth'], dtype=object)

In [10]:
for u in city_df["type"].unique():
    s = sum(city_df["type"]==u)
    print(f'{u} has {s}' )

Urban has 66
Suburban has 36
Rural has 18

In [11]:
for s in city_df["city"].unique():
        print(s)

Richardfort
Williamsstad
Port Angela
Rodneyfort
West Robert
West Anthony
West Angela
Martinezhaven
Karenberg
Barajasview
Robertport
Joneschester
Leahton
West Christopherberg
Johnton
Reynoldsfurt
Port David
New Kimberlyborough
Carriemouth
Rogerston
Jerryton
Loganberg
Simpsonburgh
Port Frank
South Latoya
West Samuelburgh
Grahamburgh
West Patrickchester
North Madeline
South Jack
Liumouth
West Ericstad
Royland
Erikaland
Huntermouth
Justinberg
South Evanton
Lake Danielberg
East Kaylahaven
West Heidi
Karenside
South Karenland
West Gabriel
North Markport
Raymondhaven
North Barbara
Lake Scottton
West Josephberg
Pattyland
South Michelleport
Christopherfurt
Valentineton
South Phillip
North Jason
Deanville
Lake Jonathanshire
New Paulton
Hurleymouth
Port Johnbury
North Jasmine
New Paulville
Amandaburgh
Williamsview
New Jacobville
Port Samanthamouth
Roberthaven
Port Shane
Lake Ann
Lake Scott
Colemanland
New Raymond
South Teresa
Myersshire
Grayville
Lake Robertside
Lewishaven
Rodriguezview
Victoriaport
Williamsonville
West Hannah
West Kimmouth
New Shannonberg
North Timothy
New Olivia
Lake Omar
Sotoville
Veronicaberg
East Kentstad
Bethanyland
South Brenda
Barronchester
Brandonfort
East Danielview
East Marymouth
Mezachester
Lewisland
Josephside
Davidfurt
Nicolechester
East Aaronbury
North Richardhaven
North Jeffrey
South Jennifer
West Heather
Newtonview
North Holly
Michaelberg
Taylorhaven
Penaborough
Harringtonfort
Lake Jamie
Lake Latoyabury
North Jaime
South Marychester
Garzaport
Bradshawfurt
New Ryantown
Randallchester
Jessicaport
South Saramouth

# Checking the Ride data

1. Take a quick look at the overall stats 
2. Look for null values
3. Check data types
4. Look at the unique values for city

In [12]:
ride_df.describe()

              fare       ride_id
count  2375.000000  2.375000e+03
mean     26.753112  4.887270e+12
std      12.109465  2.907361e+12
min       4.050000  3.218337e+08
25%      17.190000  2.381175e+12
50%      26.600000  4.748541e+12
75%      36.645000  7.461936e+12
max      58.550000  9.991538e+12

In [13]:
ride_df.count()

city       2375
date       2375
fare       2375
ride_id    2375
dtype: int64

In [14]:
ride_df.isnull().sum()

city       0
date       0
fare       0
ride_id    0
dtype: int64

In [15]:
ride_df.dtypes

city        object
date        object
fare       float64
ride_id      int64
dtype: object

In [16]:
# Checking that values in ride are in city
cnt = 0
np = 0
for u in ride_df["city"].unique():
    s = sum(city_df["city"]==u)
    if s != 1:
        print('Problem with city = ' + u)
        cnt +=1
    else: 
        np +=1
print(np)

120

# Mergering the data frames using left join

In [17]:
pyber_df = pd.merge(ride_df, city_df, how= "left", on=["city","city"])

pyber_df.head(10)

,city,date,fare,ride_id,driver_count,type
0,Lake Jonathanshire,2019-01-14 10:14:22,13.83,5739410935873,5,Urban
1,South Michelleport,2019-03-04 18:24:09,30.24,2343912425577,72,Urban
2,Port Samanthamouth,2019-02-24 04:29:00,33.44,2005065760003,57,Urban
3,Rodneyfort,2019-02-10 23:22:03,23.44,5149245426178,34,Urban
4,South Jack,2019-03-06 04:28:35,34.58,3908451377344,46,Urban
5,South Latoya,2019-03-11 12:26:48,9.52,1994999424437,10,Urban
6,New Paulville,2019-02-27 11:17:56,43.25,793208410091,44,Urban
7,Simpsonburgh,2019-04-26 00:43:24,35.98,111953927754,21,Urban
8,South Karenland,2019-01-08 03:28:48,35.09,7995623208694,4,Urban
9,North Jasmine,2019-03-09 06:26:29,42.81,5327642267789,33,Urban

In [18]:
pyber_df.describe()

              fare       ride_id  driver_count
count  2375.000000  2.375000e+03   2375.000000
mean     26.753112  4.887270e+12     28.930105
std      12.109465  2.907361e+12     20.666306
min       4.050000  3.218337e+08      1.000000
25%      17.190000  2.381175e+12     11.000000
50%      26.600000  4.748541e+12     23.000000
75%      36.645000  7.461936e+12     45.000000
max      58.550000  9.991538e+12     73.000000